[Killed] StringLiteral
main/components/Commits/CommitTable.js:20:18
     const navigate = useNavigate();
 
     const editCallback = (cell) => {
-        navigate(`/commits/edit/${cell.row.values.id}`);
+        navigate(``);
     };
 
killedBy: CommitTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/commits/edit/1"
Received: ""

Number of calls: 1

Ignored nodes: comments, script, style

[Killed] StringLiteral
main/components/Commits/CommitTable.js:44:21
         },
 
         {
-            Header: "Message",
+            Header: "",
             accessor: "message",
         },
killedBy: CommitTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Message. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/Commits/CommitTable.js:52:21
             accessor: "url",
         },
         {
-            Header: "Commit Time (in UTC)",
+            Header: "",
             accessor: "commitTime",
         },
killedBy: CommitTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Commit Time (in UTC). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table

[Killed] StringLiteral
main/components/Commits/CommitTable.js:53:23
         },
         {
             Header: "Commit Time (in UTC)",
-            accessor: "commitTime",
+            accessor: "",
         },
         {
killedBy: CommitTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CommitTable-cell-row-0-col-commitTime"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
