[Killed] ArrowFunction
main/pages/Commits/CommitsEditPage.js:28:34
     },
   );
 
-  const objectToAxiosPutParams = (commit) => ({
-    url: "/api/commits",
-    method: "PUT",
-    params: {
-      id: commit.id,
-    },
-    data: {
-      message: commit.message,
-      url: commit.url,
-      authorLogin: commit.authorLogin,
-      commitTime: `${commit.commitTime}Z`
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (commit) => {
killedBy: CommitsEditPage tests tests where backend is working normally Is populated with the data provided, and changes when data is changed
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Commit Updated - id: 17 message: pc - updated tests for blah controller edits"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] StringLiteral
main/pages/Commits/CommitsEditPage.js:38:19
       message: commit.message,
       url: commit.url,
       authorLogin: commit.authorLogin,
-      commitTime: `${commit.commitTime}Z`
+      commitTime: ``
     },
   });
killedBy: CommitsEditPage tests tests where backend is working normally Is populated with the data provided, and changes when data is changed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{\"message\":\"pc - updated tests for blah controller edits\",\"url\":\"https://github.com/ucsb-cs156-f24/team02-f24-01/commit/fe7825cf06b420552141f587a9499273b6d09916\",\"authorLogin\":\"Division7\",\"commitTime\":\"2024-10-30T12:34:02.000Z\"}"
Received: "{\"message\":\"pc - updated tests for blah controller edits\",\"url\":
