[Killed] BlockStatement
main/components/Commits/CommitForm.js:5:35
 import { useForm } from "react-hook-form";
 import { useNavigate } from "react-router-dom";
 
-export function removeZ(myString) {
-  return myString.replace("Z", "");
-}
+export function removeZ(myString) {}
 
 function CommitForm({ initialContents, submitAction, buttonLabel = "Create" }) {
killedBy: CommitsEditPage tests tests where backend is working normally Is populated with the data provided, and changes when data is changed
statusReason: Error: expect(element).toHaveValue(2024-10-31T12:34:01.000)

Expected the element to have value:
  2024-10-31T12:34:01.000
Received:

[Killed] StringLiteral
main/components/Commits/CommitForm.js:56:39
       <Form.Group className="mb-3">
         <Form.Label htmlFor="message">Message</Form.Label>
         <Form.Control
-          data-testid={testIdPrefix + "-message"}
+          data-testid={testIdPrefix + ""}
           id="message"
           type="text"
killedBy: CommitsEditPage tests tests where backend is working normally Is populated with the data provided, and changes when data is changed
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CommitForm-message"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/components/Commits/CommitForm.js:60:35
           id="message"
           type="text"
           isInvalid={Boolean(errors.message)}
-          {...register("message", {
-            required: "Message is required.",
-            maxLength: {
-              value: 255,
-              message: "Max length 255 characters",
-            },
-          })}
+          {...register("message", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: CommitForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Message is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] OptionalChaining
main/components/Commits/CommitForm.js:69:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.message?.message}
+          {errors.message.message}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: CommitForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
main/components/Commits/CommitForm.js:80:23
           type="text"
           isInvalid={Boolean(errors.url)}
           {...register("url", {
-            required: "Url is required.",
+            required: "",
           })}
         />
killedBy: CommitForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Url is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] OptionalChaining
main/components/Commits/CommitForm.js:99:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.authorLogin?.message}
+          {errors.authorLogin.message}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: CommitForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] BooleanLiteral
main/components/Commits/CommitForm.js:110:23
           type="datetime-local"
           isInvalid={Boolean(errors.commitTime)}
           {...register("commitTime", {
-            required: true,
+            required: false,
             pattern: isodate_regex,
           })}
killedBy: CommitForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Commit Time is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/Commits/CommitForm.js:115:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.commitTime && "Commit Time is required. "}
+          {true}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: CommitForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Commit Time is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/Commits/CommitForm.js:115:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.commitTime && "Commit Time is required. "}
+          {errors.commitTime || "Commit Time is required. "}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: CommitForm tests that the correct validations are performed
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.
