[Killed] StringLiteral
main/components/Commits/CommitTable.js:15:18
 export default function CommitTable({
   commits,
   currentUser,
-  testIdPrefix = "CommitTable",
+  testIdPrefix = "",
 }) {
   const navigate = useNavigate();
killedBy: CommitTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CommitTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] BlockStatement
main/components/Commits/CommitTable.js:19:34
 }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/commits/edit/${cell.row.values.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: CommitTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/commits/edit/1"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] ArrayDeclaration
main/components/Commits/CommitTable.js:37:19
     deleteMutation.mutate(cell);
   };
 
-  const columns = [
-    {
-      Header: "id",
-      accessor: "id", // accessor is the "key" in the data
-    },
-
-    {
-      Header: "Message",
-      accessor: "message",
-    },
-    {
-      Header: "URL",
-      accessor: "url",
-    },
-    {
-      Header: "Commit Time (in UTC)",
-      accessor: "commitTime",
-    },
-    {
-      Header: "Author Login",
-      accessor: "authorLogin",
-    },
-  ];
+  const columns = [];
 
   if (hasRole(currentUser, "ROLE_ADMIN")) {
killedBy: CommitTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ObjectLiteral
main/components/Commits/CommitTable.js:47:5
       Header: "Message",
       accessor: "message",
     },
-    {
-      Header: "URL",
-      accessor: "url",
-    },
+    {},
     {
       Header: "Commit Time (in UTC)",
killedBy: CommitIndexPage tests Renders with Create Button for admin user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Commits/CommitTable.js:48:15
       accessor: "message",
     },
     {
-      Header: "URL",
+      Header: "",
       accessor: "url",
     },
killedBy: CommitTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: URL. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/Commits/CommitTable.js:49:17
     },
     {
       Header: "URL",
-      accessor: "url",
+      accessor: "",
     },
     {
killedBy: CommitIndexPage tests renders three commits correctly for regular user
statusReason: 
Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/components/Commits/CommitTable.js:55:5
       Header: "Commit Time (in UTC)",
       accessor: "commitTime",
     },
-    {
-      Header: "Author Login",
-      accessor: "authorLogin",
-    },
+    {},
   ];
 
killedBy: CommitTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!
