[Killed] BooleanLiteral
main/pages/Commits/CommitsCreatePage.js:7:57
 import { useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export default function CommitsCreatePage({ storybook = false }) {
+export default function CommitsCreatePage({ storybook = true }) {
   const addZ = (string) => `${string}Z`;
 
killedBy: CommitsCreatePage tests on submit, makes request to backend, and redirects to /commits
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"to": "/commits"}

Number of calls: 0

[Killed] ArrowFunction
main/pages/Commits/CommitsCreatePage.js:8:16
 import { toast } from "react-toastify";
 
 export default function CommitsCreatePage({ storybook = false }) {
-  const addZ = (string) => `${string}Z`;
+  const addZ = () => undefined;
 
   const objectToAxiosParams = (commit) => ({
killedBy: CommitsCreatePage tests on submit, makes request to backend, and redirects to /commits
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "authorLogin": "pconrad",
-   "commitTime": "2024-10-31T12:34:12.000Z",

[Killed] StringLiteral
main/pages/Commits/CommitsCreatePage.js:8:28
 import { toast } from "react-toastify";
 
 export default function CommitsCreatePage({ storybook = false }) {
-  const addZ = (string) => `${string}Z`;
+  const addZ = (string) => ``;
 
   const objectToAxiosParams = (commit) => ({
killedBy: CommitsCreatePage tests on submit, makes request to backend, and redirects to /commits
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "authorLogin": "pconrad",
-   "commitTime": "2024-10-31T12:34:12.000Z",

[Killed] ArrowFunction
main/pages/Commits/CommitsCreatePage.js:10:31
 export default function CommitsCreatePage({ storybook = false }) {
   const addZ = (string) => `${string}Z`;
 
-  const objectToAxiosParams = (commit) => ({
-    url: "/api/commits/post",
-    method: "POST",
-    params: {
-      message: commit.message,
-      url: commit.url,
-      authorLogin: commit.authorLogin,
-      commitTime: addZ(commit.commitTime),
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (commit) => {
killedBy: CommitsCreatePage tests on submit, makes request to backend, and redirects to /commits
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/pages/Commits/CommitsCreatePage.js:11:10
   const addZ = (string) => `${string}Z`;
 
   const objectToAxiosParams = (commit) => ({
-    url: "/api/commits/post",
+    url: "",
     method: "POST",
     params: {
killedBy: CommitsCreatePage tests on submit, makes request to backend, and redirects to /commits
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "New commit Created - id: 7 message: pc - updated tests for blah controller"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] StringLiteral
main/pages/Commits/CommitsCreatePage.js:12:13
 
   const objectToAxiosParams = (commit) => ({
     url: "/api/commits/post",
-    method: "POST",
+    method: "",
     params: {
       message: commit.message,
killedBy: CommitsCreatePage tests on submit, makes request to backend, and redirects to /commits
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/pages/Commits/CommitsCreatePage.js:21:33
     },
   });
 
-  const onSuccess = (commit) => {
-    toast(`New commit Created - id: ${commit.id} message: ${commit.message}`);
-  };
+  const onSuccess = (commit) => {};
 
   const mutation = useBackendMutation(
killedBy: CommitsCreatePage tests on submit, makes request to backend, and redirects to /commits
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "New commit Created - id: 7 message: pc - updated tests for blah controller"

Number of calls: 0

[Killed] StringLiteral
main/pages/Commits/CommitsCreatePage.js:22:11
   });
 
   const onSuccess = (commit) => {
-    toast(`New commit Created - id: ${commit.id} message: ${commit.message}`);
+    toast(``);
   };
 
killedBy: CommitsCreatePage tests on submit, makes request to backend, and redirects to /commits
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "New commit Created - id: 7 message: pc - updated tests for blah controller"
Received: ""

Number of calls: 1
