[Killed] BooleanLiteral
main/pages/Commits/CommitsEditPage.js:8:54
 import { useBackend, useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export default function CommitEditPage({ storybook = false }) {
+export default function CommitEditPage({ storybook = true }) {
   let { id } = useParams();
 
killedBy: CommitsEditPage tests tests where backend is working normally Is populated with the data provided, and changes when data is changed
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"to": "/commits"}

Number of calls: 0

[Killed] ObjectLiteral
main/pages/Commits/CommitsEditPage.js:22:15
       // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
       method: "GET",
       url: `/api/commits`,
-      params: {
-        id,
-      },
+      params: {},
     },
   );
killedBy: CommitsEditPage tests tests where backend is working normally Is populated with the data provided, and changes when data is changed
statusReason: Error: Unable to find an element by: [data-testid="CommitForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/Commits/CommitsEditPage.js:28:34
     },
   );
 
-  const objectToAxiosPutParams = (commit) => ({
-    url: "/api/commits",
-    method: "PUT",
-    params: {
-      id: commit.id,
-    },
-    data: {
-      message: commit.message,
-      url: commit.url,
-      authorLogin: commit.authorLogin,
-      commitTime: `${commit.commitTime}Z`,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (commit) => {
killedBy: CommitsEditPage tests tests where backend is working normally Is populated with the data provided, and changes when data is changed
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Commit Updated - id: 17 message: pc - updated tests for blah controller edits"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] StringLiteral
main/pages/Commits/CommitsEditPage.js:38:19
       message: commit.message,
       url: commit.url,
       authorLogin: commit.authorLogin,
-      commitTime: `${commit.commitTime}Z`,
+      commitTime: ``,
     },
   });
killedBy: CommitsEditPage tests tests where backend is working normally Is populated with the data provided, and changes when data is changed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{\"message\":\"pc - updated tests for blah controller edits\",\"url\":\"https://github.com/ucsb-cs156-f24/team02-f24-01/commit/fe7825cf06b420552141f587a9499273b6d09916\",\"authorLogin\":\"Division7\",\"commitTime\":\"2024-10-30T12:34:02.000Z\"}"
Received: "{\"message\":\"pc - updated tests for blah controller edits\",\"url\":

[Killed] BlockStatement
main/pages/Commits/CommitsEditPage.js:42:33
     },
   });
 
-  const onSuccess = (commit) => {
-    toast(`Commit Updated - id: ${commit.id} message: ${commit.message}`);
-  };
+  const onSuccess = (commit) => {};
 
   const mutation = useBackendMutation(
killedBy: CommitsEditPage tests tests where backend is working normally Is populated with the data provided, and changes when data is changed
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/pages/Commits/CommitsEditPage.js:59:32
     mutation.mutate(data);
   };
 
-  if (isSuccess && !storybook) {
-    return <Navigate to="/commits" />;
-  }
+  if (isSuccess && !storybook) {}
 
   return (
killedBy: CommitsEditPage tests tests where backend is working normally Is populated with the data provided, and changes when data is changed
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"to": "/commits"}

Number of calls: 0

[Killed] LogicalOperator
main/pages/Commits/CommitsEditPage.js:67:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Commit</h1>
-        {commit && (
-          <CommitForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={commit}
-          />
-        )}
+        {commit || <CommitForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={commit} />}
       </div>
     </BasicLayout>
killedBy: CommitsEditPage tests tests where backend is working normally Is populated with the data provided, and changes when data is changed
statusReason: Error: Objects are not valid as a React child (found: object with keys {id, message, url, authorLogin, commitTime}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/pages/Commits/CommitsEditPage.js:67:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Commit</h1>
-        {commit && (
-          <CommitForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={commit}
-          />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: CommitsEditPage tests tests where backend is working normally Is populated with the data provided, and changes when data is changed
statusReason: Error: Unable to find an element by: [data-testid="CommitForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
