[Killed] StringLiteral
main/pages/Commits/CommitsIndexPage.js:19:15
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/commits/all"],
-    { method: "GET", url: "/api/commits/all" },
+    { method: "", url: "/api/commits/all" },
     // Stryker disable next-line all : don't test default value of empty list
     [],
killedBy: CommitIndexPage tests renders empty table when backend unavailable, user only
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "Error communicating with backend via GET on /api/commits/all"
Received string:    "Error communicating with backend via  on /api/commits/all"

[Killed] BlockStatement
main/pages/Commits/CommitsIndexPage.js:24:30
     [],
   );
 
-  const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return (
-        <Button
-          variant="primary"
-          href="/commits/create"
-          style={{ float: "right" }}
-        >
-          Create Commit
-        </Button>
-      );
-    }
-  };
+  const createButton = () => {};
 
   return (
killedBy: CommitIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create Commit/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/pages/Commits/CommitsIndexPage.js:25:45
   );
 
   const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return (
-        <Button
-          variant="primary"
-          href="/commits/create"
-          style={{ float: "right" }}
-        >
-          Create Commit
-        </Button>
-      );
-    }
+    if (hasRole(currentUser, "ROLE_ADMIN")) {}
   };
 
killedBy: CommitIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create Commit/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
