[Killed] BlockStatement
src/main/utils/commitUtils.js:8:47
   toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: "/api/commits",
-    method: "DELETE",
-    params: {
-      id: cell.row.values.id,
-    },
-  };
-}
+export function cellToAxiosParamsDelete(cell) {}
 
killedBy: CommitIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Commit with id 1 was deleted"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] StringLiteral
src/main/utils/commitUtils.js:11:13
 export function cellToAxiosParamsDelete(cell) {
   return {
     url: "/api/commits",
-    method: "DELETE",
+    method: "",
     params: {
       id: cell.row.values.id,
killedBy: CommitIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Commit with id 1 was deleted"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2
