[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestTable.js:58:5
       Header: "Explanation",
       accessor: "explanation",
     },
-    {
-      Header: "Request Resolved?",
-      id: "solved",
-      accessor: (helpRequest) => helpRequest.solved.toString(),
-    },
+    {},
   ];
 
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.js:59:15
       accessor: "explanation",
     },
     {
-      Header: "Request Resolved?",
+      Header: "",
       id: "solved",
       accessor: (helpRequest) => helpRequest.solved.toString(),
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Request Resolved?. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ArrowFunction
main/components/HelpRequest/HelpRequestTable.js:61:17
     {
       Header: "Request Resolved?",
       id: "solved",
-      accessor: (helpRequest) => helpRequest.solved.toString(),
+      accessor: () => undefined,
     },
   ];
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  true
Received:
