[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:54:12
         />
         <Form.Control.Feedback type="invalid">
           {errors.requesterEmail && "Requester Email is required."}
-          {errors.requesterEmail?.type === "pattern" &&
-            "Requester Email must match email format."}
+          {true}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: HelpRequestForm tests Correct Error messages on bad input
statusReason: Error: Unable to find an element with the text: /Requester Email must match email format\./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/HelpRequest/HelpRequestForm.js:70:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.teamId && "Team ID is required."}
+          {errors.teamId || "Team ID is required."}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: HelpRequestForm tests Correct Error messages on bad input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:87:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.tableOrBreakoutRoom && "Table or Breakout Room is required."}
+          {false}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: HelpRequestForm tests Correct Error messages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Table or Breakout Room is required\./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:87:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.tableOrBreakoutRoom && "Table or Breakout Room is required."}
+          {true}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: HelpRequestForm tests Correct Error messages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Table or Breakout Room is required\./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:137:12
           <option value="false">No</option>
         </Form.Control>
         <Form.Control.Feedback type="invalid">
-          {errors.solved && "Resolution is required."}
+          {true}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: HelpRequestForm tests Correct Error messages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Resolution is required\./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:137:12
           <option value="false">No</option>
         </Form.Control>
         <Form.Control.Feedback type="invalid">
-          {errors.solved && "Resolution is required."}
+          {false}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: HelpRequestForm tests Correct Error messages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Resolution is required\./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
