[Killed] BlockStatement
main/pages/HelpRequest/HelpRequestCreatePage.js:21:38
     },
   });
 
-  const onSuccess = (helprequest) => {
-    toast(
-      `New help request created - id: ${helprequest.id} table: ${helprequest.tableOrBreakoutRoom}`,
-    );
-  };
+  const onSuccess = (helprequest) => {};
 
   const mutation = useBackendMutation(
killedBy: HelpRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New help request created - id: 17 table: table 17"

Number of calls: 0

[Killed] StringLiteral
main/pages/HelpRequest/HelpRequestCreatePage.js:23:7
 
   const onSuccess = (helprequest) => {
     toast(
-      `New help request created - id: ${helprequest.id} table: ${helprequest.tableOrBreakoutRoom}`,
+      ``,
     );
   };
killedBy: HelpRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New help request created - id: 17 table: table 17"
Received: ""

Number of calls: 1
